In [1]:
import pyspark

In [2]:
import pandas as pd

In [3]:
pd.read_csv('Book1.csv')

      name   age  experience   salary
0     kart  10.0         5.0  10000.0
1     tech  11.0         3.0      NaN
2    manoj  12.0         4.0  10000.0
3  kishore  20.0         NaN   5000.0
4    sambu  21.0        20.0  25000.0
5    pambu   NaN         2.0  50000.0

In [4]:
from pyspark.sql import SparkSession

In [5]:
spark = SparkSession.builder.appName('practiceTwo').getOrCreate()

In [6]:
df_two = spark.read.csv('Book1.csv',header=True,inferSchema=True)

In [7]:
df_two.show()

+-------+----+----------+------+
|   name| age|experience|salary|
+-------+----+----------+------+
|   kart|  10|         5| 10000|
|   tech|  11|         3|  NULL|
|  manoj|  12|         4| 10000|
|kishore|  20|      NULL|  5000|
|  sambu|  21|        20| 25000|
|  pambu|NULL|         2| 50000|
+-------+----+----------+------+

In [8]:
type(df_two)

pyspark.sql.dataframe.DataFrame

In [11]:
# df_two.drop('name').show()

In [10]:
df_two.show()

+-------+----+----------+------+
|   name| age|experience|salary|
+-------+----+----------+------+
|   kart|  10|         5| 10000|
|   tech|  11|         3|  NULL|
|  manoj|  12|         4| 10000|
|kishore|  20|      NULL|  5000|
|  sambu|  21|        20| 25000|
|  pambu|NULL|         2| 50000|
+-------+----+----------+------+

In [12]:
df_two.na.drop().show()

+-----+---+----------+------+
| name|age|experience|salary|
+-----+---+----------+------+
| kart| 10|         5| 10000|
|manoj| 12|         4| 10000|
|sambu| 21|        20| 25000|
+-----+---+----------+------+

In [15]:
df_two.na.drop(how='any').show()

+-----+---+----------+------+
| name|age|experience|salary|
+-----+---+----------+------+
| kart| 10|         5| 10000|
|manoj| 12|         4| 10000|
|sambu| 21|        20| 25000|
+-----+---+----------+------+

In [18]:
##threshold - select based on non-null value in the row
df_two.na.drop(how='any',thresh=2).show()

+-------+----+----------+------+
|   name| age|experience|salary|
+-------+----+----------+------+
|   kart|  10|         5| 10000|
|   tech|  11|         3|  NULL|
|  manoj|  12|         4| 10000|
|kishore|  20|      NULL|  5000|
|  sambu|  21|        20| 25000|
|  pambu|NULL|         2| 50000|
+-------+----+----------+------+

In [19]:
df_two.na.drop(how="any",subset=['Age']).show()

+-------+---+----------+------+
|   name|age|experience|salary|
+-------+---+----------+------+
|   kart| 10|         5| 10000|
|   tech| 11|         3|  NULL|
|  manoj| 12|         4| 10000|
|kishore| 20|      NULL|  5000|
|  sambu| 21|        20| 25000|
+-------+---+----------+------+

In [27]:
##filling the missing values.. 
#use the fill parameter that takes two parameters
#One is replace value, columns

df_two.na.fill(100,['age']).show()

+-------+---+----------+------+
|   name|age|experience|salary|
+-------+---+----------+------+
|   kart| 10|         5| 10000|
|   tech| 11|         3|  NULL|
|  manoj| 12|         4| 10000|
|kishore| 20|      NULL|  5000|
|  sambu| 21|        20| 25000|
|  pambu|100|         2| 50000|
+-------+---+----------+------+

In [33]:
#imputer functions

from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age','experience','salary'],
    outputCols=["{}_new".format(c) for c in ['age','experience','salary']]
).setStrategy('mean')

In [35]:
#tranforming the imputers to df
imputer.fit(df_two).transform(df_two).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   name| age|experience|salary|age_imputed|experience_imputed|salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|   kart|  10|         5| 10000|         10|                 5|         10000|
|   tech|  11|         3|  NULL|         11|                 3|         20000|
|  manoj|  12|         4| 10000|         12|                 4|         10000|
|kishore|  20|      NULL|  5000|         20|                 6|          5000|
|  sambu|  21|        20| 25000|         21|                20|         25000|
|  pambu|NULL|         2| 50000|         14|                 2|         50000|
+-------+----+----------+------+-----------+------------------+--------------+

In [36]:
#filter operations
#&, |,==
#~